{"text": ["Patient Name: John Doe\nAge: 34\nGender: Male\nOccupation: IT Professional\nDate: [Insert Date]\nChief Complaint:\nThe patient reports recurring severe migraines over the past 6 months, accompanied by\nnausea, light sensitivity, and difficulty concentrating. Episodes occur 3–4 times per week, lasting\n6–8 hours.\nHistory of Present Illness:\n●\nOnset: Gradual onset of migraines starting approximately 6 months ago.\n●\nFrequency: 3–4 episodes per week.\n●\nTriggers: Stressful work deadlines, prolonged screen time, and lack of sleep.\n●\nSymptoms:\n○\nIntense throbbing pain, localized on one side of the head.\n○\nNausea and occasional vomiting.\n○\nSensitivity to light and sound (photophobia and phonophobia).\n○\nCognitive difficulties during episodes.\nMedical History:\n●\nPast Conditions: No significant history of chronic illness.\n●\nMedications: Occasionally uses over-the-counter painkillers (ibuprofen, paracetamol).\n●\nFamily History: No known family history of migraines.\nLifestyle and Occupational History:\n●\nOccupation: Works as a software developer in a high-pressure IT environment.\n●\nWorkplace Factors: Reports toxic work culture, including unrealistic deadlines, lack of\nwork-life balance, and inadequate support.\n●\nSleep Patterns: Sleeps 4–5 hours on average due to workload and stress.\n●\nDietary Habits: Irregular meals, heavy caffeine consumption (4–5 cups daily).\n●\nPhysical Activity: Minimal exercise.\n", "Examination Findings:\n●\nVital Signs:\n○\nBlood Pressure: 130/85 mmHg (elevated).\n○\nHeart Rate: 88 bpm.\n●\nNeurological Examination: No focal deficits noted.\n●\nGeneral Appearance: Appears fatigued and stressed.\nAssessment:\n●\nDiagnosis: Chronic Migraine with probable stress-induced exacerbation.\n●\nContributing Factors:\n1.\nOccupational stress and toxic work environment.\n2.\nPoor sleep hygiene and irregular dietary habits.\n3.\nExcessive caffeine intake.\nPlan and Recommendations:\n1.\nMedical Treatment:\n○\nPrescribe triptans (e.g., Sumatriptan) for acute migraine relief.\n○\nPreventative medication: Propranolol (beta-blocker) or Topiramate if migraines\npersist.\n2.\nLifestyle Modifications:\n○\nImplement regular sleep schedule (7–8 hours).\n○\nLimit screen exposure by taking regular breaks (20-20-20 rule).\n○\nIncorporate moderate physical activity (e.g., 30 minutes of walking 5 times per\nweek).\n○\nMaintain a balanced diet with reduced caffeine consumption.\n3.\nStress Management:\n○\nExplore relaxation techniques such as meditation, yoga, or deep-breathing\nexercises.\n○\nRefer to a mental health professional for workplace stress counseling.\n○\nEncourage seeking a supportive work environment or considering a career\nchange.\n4.\nFollow-Up:\n○\nSchedule a follow-up appointment in 4 weeks to assess response to treatment\nand adjust as needed.\n", "Doctor's Notes:\nPatient education is critical to understanding the impact of stress and lifestyle on migraines.\nLong-term management should focus on reducing occupational stress and fostering better\nself-care practices.\nSigned:\n[Dr, Vijay Joseph], MD\n[Neurologist]\n[1234567890]\n"], "links": [], "images": [], "tables": []}